
// translate.py 에 사용된 javascript 기본소스입니다.

const m = {
    tranlyze: {
    key: {},
    list: {}
    }
}


m.tranlyze.key_b = { //점자
    en2 : [ // grade 2
    ["st", "⠌"], ["ar", "⠜"],
    ["and", "⠯"], ["for", "⠿"], ["of", "⠷"], ["the", "⠮"], ["with", "⠾"], ["-ing", "⠬"], ["-ble", "⠼"],
    ["ch", "⠡"], ["gh", "⠣"], ["sh", "⠩"], ["th", "⠹"], ["wh", "⠱"], ["ed", "⠫"], ["er", "⠻"], ["ou", "⠳"], ["ow", "⠪"],
    ["-ea-", "⠂"], ["-bb-", "⠆"], ["-cc-", "⠒"], ["-dd-", "⠲"], ["-en-", "⠢"], ["-ff-", "⠖"], ["-gg-", "⠶"], ["“", "⠦"], ["in", "⠔"],  ["”", "⠴"],
    ["com-", "⠤"],
    ],
    en : [
    ["a", "⠁"], ["b", "⠃"], ["c", "⠉"], ["d", "⠙"],
    ["e", "⠑"], ["f", "⠋"], ["g", "⠛"], ["h", "⠓"],
    ["i", "⠊"], ["j", "⠚"], ["k", "⠅"], ["l", "⠇"], ["m", "⠍"], ["n", "⠝"],
    ["o", "⠕"], ["p", "⠏"], ["q", "⠟"], ["r", "⠗"], ["s", "⠎"], ["t", "⠞"],
    ["u", "⠥"], ["v", "⠧"], ["w", "⠺"], ["x", "⠭"], ["y", "⠽"], ["z", "⠵"],
    ["(cap)", "⠠"],

      ["␃", "␃"], // ␃ = 텍스트 끝을 나타내는 기호

      // ["(", "⠶"], [")", "⠶"],
    ],
    kr : [
    // 약자
    ["가", "⠫"], ["사", "⠇"], ["것", "⠸⠎"], /*["ᆻ", "⠌"],*/
    ["ᅥᆨ", "⠹"], ["ᅥᆫ", "⠾"], ["ᅥᆯ", "⠞"], ["ᅧᆫ", "⠡"], ["ᅧᆯ", "⠳"], ["ᅧᆼ", "⠻"], ["ᅩᆨ", "⠭"], ["ᅩᆫ", "⠷"], ["ᅩᆼ", "⠿"], ["ᅮᆫ", "⠛"], ["ᅮᆯ", "⠯"], ["ᅳᆫ", "⠵"], ["ᅳᆯ", "⠮"], ["ᅵᆫ", "⠟"],
    ["그래서", "⠁⠎"], ["그러나", "⠁⠉"], ["그러면", "⠁⠒"], ["그러므로", "⠁⠢"], ["그런데", "⠁⠝"], ["그리고", "⠁⠥"], ["그리하여", "⠁⠱"],

    // 조합형
    ["ᄀ", "⠈"], ["ᄁ", "⠠⠈"],  // 초성
    ["ᄂ", "⠉"],
    ["ᄃ", "⠊"], ["ᄄ", "⠠⠊"],
    ["ᄅ", "⠐"],
    ["ᄆ", "⠑"], ["ᄇ", "⠘"], ["ᄈ", "⠠⠘"],
    ["ᄉ", "⠠"], ["ᄊ", "⠠⠠"],
    ["ㅇ", "⠛"], /*["ᄋ", ""],*/
    ["ᄌ", "⠨"], ["ᄍ", "⠠⠨"],
    ["ᄎ", "⠰"], ["ᄏ", "⠋"], ["ᄐ", "⠓"], ["ᄑ", "⠙"], ["ᄒ", "⠚"],

    ["ᅡ", "⠣"], ["ᅢ", "⠗"], ["ᅣ", "⠜"], ["ᅤ", "⠜⠗"], // 중성
    ["ᅥ", "⠎"], ["ᅦ", "⠝"], ["ᅧ", "⠱"], ["ᅨ", "⠌"],
    ["ᅩ", "⠥"], ["ᅪ", "⠧"], ["ᅫ", "⠧⠗"], ["ᅬ", "⠽"], ["ᅭ", "⠬"],
    ["ᅮ", "⠍"], ["ᅯ", "⠏"], ["ᅰ", "⠏⠗"], ["ᅱ", "⠍⠗"], ["ᅲ", "⠩"],
    ["ᅳ", "⠪"], ["ᅴ", "⠺"], ["ᅵ", "⠕"],

    ["×", "⠭"],["○", "⠴"],

    ["␃", "␃"], // ␃ = 코브북 브레이커

    ["ᆨ", "⠁"], ["ᆩ", "⠈⠈"], ["ᆪ", "⠈⠠"], // 종성
    ["ᆫ", "⠒"], ["ᆬ", "⠒⠅"], ["ᆭ", "⠒⠴"],
    ["ᆮ", "⠔"], ["ᆯ", "⠂"], ["ᆰ", "⠂⠁"], ["ᆱ", "⠂⠢"], ["ᆲ", "⠂⠃"], ["ᆳ", "⠂⠄"], ["ᆴ", "⠂⠦"], ["ᆵ", "⠂⠲"], ["ᆶ", "⠂⠴"],
    ["ᆷ", "⠢"], ["ᆸ", "⠃"], ["ᆹ", "⠃⠄"],
    ["ᆺ", "⠄"],
    ["ᆼ", "⠶"], ["ᆽ", "⠅"], ["ᆾ", "⠆"], ["ᆿ", "⠖"], ["ᇀ", "⠦"], ["ᇁ", "⠲"], ["ᇂ", "⠴"],

    // 완성형
    ["ㄱ", "⠈"], ["ㄲ", "⠠⠈"], ["ㄳ", "⠈⠠"],  // 자음
    ["ㄴ", "⠉"], ["ㄵ", "⠉⠨"], ["ㄶ", "⠉⠚"],
    ["ㄷ", "⠊"], ["ㄸ", "⠠⠊"],
    ["ㄹ", "⠐"], ["ㄺ", "⠐⠈"], ["ㄻ", "⠐⠑"], ["ㄼ", "⠐⠘"], ["ㄽ", "⠐⠠"], ["ㄾ", "⠐⠓"], ["ㄿ", "⠐⠙"], ["ㅀ", "⠐⠚"],
    ["ㅁ", "⠑"], ["ㅂ", "⠘"], ["ㅃ", "⠠⠘"], ["ㅄ", "⠘⠠"],
    ["ㅅ", "⠠"], ["ㅆ", "⠠⠠"],
    ["ㅈ", "⠨"], ["ㅉ", "⠠⠨"],
    ["ㅊ", "⠰"], ["ㅋ", "⠋"], ["ㅌ", "⠓"], ["ㅍ", "⠙"], ["ㅎ", "⠚"],

    ["ㅏ", "⠣"], ["ㅐ", "⠗"], ["ㅑ", "⠜"], ["ㅒ", "⠜⠗"], // 모음
    ["ㅓ", "⠎"], ["ㅔ", "⠝"], ["ㅕ", "⠱"], ["ㅖ", "⠌"],
    ["ㅗ", "⠥"], ["ㅘ", "⠧"], ["ㅙ", "⠧⠗"], ["ㅚ", "⠽"], ["ㅛ", "⠬"],
    ["ㅜ", "⠍"], ["ㅝ", "⠏"], ["ㅞ", "⠏⠗"], ["ㅟ", "⠍⠗"], ["ㅠ", "⠩"],
    ["ㅡ", "⠪"], ["ㅢ", "⠺"], ["ㅣ", "⠕"],


      // 약자
      /* ["가", "⠫"], ["사", "⠇"], ["것", "⠸⠌"],*/ ["ᆻ", "⠌"], //폐-팠 문제로 잠깐 보류 */
      // ["ᅥᆨ", "⠹"], ["ᅥᆫ", "⠾"], ["ᅥᆯ", "⠞"], ["ᅧᆫ", "⠡"], ["ᅧᆯ", "⠳"], ["ᅧᆼ", "⠻"], ["ᅩᆨ", "⠭"], ["ᅩᆫ", "⠷"], ["ᅩᆼ", "⠿"], ["ᅮᆫ", "⠛"], ["ᅮᆯ", "⠯"], ["ᅳᆫ", "⠵"], ["ᅳᆯ", "⠮"], ["ᅵᆫ", "⠟"],

      // ["ᄋ", "⠛"], ["ᄋ", ""],

      // 문장 부호
    ["(붙임)", "⠤"], [",", "⠐"], [".", "⠲"], [":", "⠐⠂"], ["(", "⠦⠄"], [")", "⠠⠴"], ["‘", "⠠⠦"], ["’", "⠴⠄"], ["'", "⠴⠄"],
    ],


    nm : [
    [" ", "⠀"], ["(num)", "⠼"], ["0", "⠚"], ["1", "⠁"], ["2", "⠃"], ["3", "⠉"], ["4", "⠙"], ["5", "⠑"], ["6", "⠋"], ["7", "⠛"], ["8", "⠓"], ["9", "⠊"],
    [",", "⠂"], [".", "⠲"], [";", "⠆"], [":", "⠒"], [".", "⠄"], ["!", "⠖"], ["?", "⠦"]
    ]
}

const LANG_KO = 1;
const LANG_EN = 2;

function analyze_b(lang, text) {


var j, k, output = '';

// input, output 제어
// var text = $('#input_textarea').val();
// var space_char = new RegExp($('#space_char').text(), 'g');
// // var space_string = new RegExp($('#space_string').text() + '|\n|\r', 'g');
// var space_string = new RegExp($('#space_string').text(), 'g');



text = text.replace(/\n|\r/g, ""); //줄바꿈


if (lang == LANG_KO) pre_assemble(LANG_KO);
if (lang == LANG_EN) pre_assemble(LANG_EN);
var input = text.split('');



// 분석1
function analyze_sub(key_set, input) {
    // var v = input;
    for (var i = 0; i < input.length; i++) {
    for (var j = 0; j < key_set.length; j++) {
        if (key_set[j][1].length == 2) {
        // console.log([input[i], key_set[j][0], key_set[j][1]]);
        if (input[i] == key_set[j][1][0] && input[i + 1] == key_set[j][1][1]) { // di- analyze
            input[i] = key_set[j][0];
            input[i + 1] = "";
            break;
        }
        } 
        else if (input[i] == key_set[j][1]) { // main analyze
        input[i] = key_set[j][0];
        break;
        }
    }
    }
    return input;
}


// 분석전 initialize 과정
function pre_assemble(lang) {
    if (lang == LANG_EN) {
    // text = text.replace(/A-Z/g, analyze_sub(m.tranlyze.key_b.en, "$1"));
    } else if (lang == LANG_KO) {
    // text = text.replace(/([\s⠀]⠴|^⠴)(\S*)⠲/g, function(v) { // 한글 와중에 영어  todo
    //   return analyze_sub(m.tranlyze.key_b.en, v.substring(1, v.length - 1).split('')).join("");
    // })
    text = text.replace(/([⠠⠨⠰])⠻/g, "$1ᅥᆼ") // ㅅㅆㅈㅉㅊ 뒤에 ㅕㅇ, ㅓㅇ 변환
        .replace(/⠐⠂/g, ":"); // 한글 문장부호
    }


    //문장부호
    text = text
    .replace(/⠦⠄/g, "(")
    .replace(/⠠⠴/g, ")")
    // x(?<=y) x(?<!y) may couse error on safari
    // .replace(/(⠚)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊])+)/g, "0")
    // .replace(/(⠁)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "1")
    // .replace(/(⠃)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "2")
    // .replace(/(⠉)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "3")
    // .replace(/(⠙)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "4")
    // .replace(/(⠑)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "5")
    // .replace(/(⠋)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "6")
    // .replace(/(⠛)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "7")
    // .replace(/(⠓)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "8")
    // .replace(/(⠊)(?<=⠼([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])+)(?=([⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊\d])*)/g, "9")
    .replace(/⠼/g, "")
    .replace(/⠸([⠭⠴]+)⠇/g, "$1"); //숨김표: 가위표, 동그라미표
}


function assemble() {
    output = output
    .replace(/⠀/g, " ") // 문장부호
    .replace(/ᇁ\s/g, ". ")
    .replace(/ᇁ$/g, ". ")
    .replace(/ᄅ\s/g, ", ")
    .replace(/ᄅ$/g, ", ")
    .replace(/ᄉᇀ/g, "\'")
    .replace(/ᇂᆺ/g, "\'")
    .replace(/ᇀ\s/g, "?")
    .replace(/ᇀ$/g, "?")
    .replace(/ᆿ\s/g, "!")
    .replace(/ᆿ$/g, "!")
    .replace(/([ᅡ-ᅵ])\(붙임\)ᆻ/g, "$1예") // 모음 뒤에 '예'가 올 때는 붙임표
    .replace(/([ᅣᅪᅮᅯ])\(붙임\)ᅢ/g, "$1애") // ㅑ, ㅘ, ㅜ, ㅝ 뒤에 '애'가 올 때는 붙임표
    .replace(/([ᄀ-ᄒ])\(붙임\)/g, "$1ᅡ")
    .replace(/ᄑᆻ/g, "폐") // 팠 폐
    // .replace(/\(num\)ᄒ/g, "0") // 숫자
    // .replace(/\(num\)ᄀ/g, "1")
    // .replace(/\(num\)ᄇ/g, "2")
    // .replace(/\(num\)ᄂ/g, "3")
    // .replace(/\(num\)ㅍ/g, "4")
    // .replace(/\(num\)ᄆ/g, "5")
    // .replace(/\(num\)ᄏ/g, "6")
    // .replace(/\(num\)ᄋ/g, "7")
    // .replace(/\(num\)ᅮ/g, "8")
    // .replace(/\(num\)ᄃ/g, "9")
    .replace(/ᅮᅢ/g, "ᅱ") 
    .replace(/ᅣᅢ/g, "ᅤ")
    .replace(/ᅯᅢ/g, "ᅰ")
    .replace(/ᅪᅢ/g, "ᅫ")
    // .replace(/ᄉᄉ/g, "ᄊ") // 된소리 초성 / 쌍시옷이 제일 앞에 있어야 함.
    // .replace(/ᄉᄀ/g, "ᄁ")
    // .replace(/ᄉᄃ/g, "ᄄ")
    // .replace(/ᄉᄇ/g, "ᄈ")
    // .replace(/ᄉᄌ/g, "ᄍ")
    // .replace(/ᆨᆨ/g, "ᆩ") // 받침 조합
    // .replace(/ᆨᆺ/g, "ᆪ")
    // .replace(/ᆫᆽ/g, "ᆬ")
    // .replace(/ᆫᇂ/g, "ᆭ")
    // .replace(/ᆯᆨ/g, "ᆰ")
    // .replace(/ᆯᆷ/g, "ᆱ")
    // .replace(/ᆯᆸ/g, "ᆲ")
    // .replace(/ᆯᆺ/g, "ᆳ")
    // .replace(/ᆯᇀ/g, "ᆴ")
    // .replace(/ᆯᇁ/g, "ᆵ")
    // .replace(/ᆯᇂ/g, "ᆶ")
    // .replace(/ᆸᆺ/g, "ᆹ")
    // .replace(/ᆺᆺ/g, "ᆻ")
    // .replace(/ᆨ어/g, "그런데") // 약자 todo
    // .replace(/⠸[어예]/g, "것")
    // .replace(/⠸ᆻ/g, "것")
    .replace(/([ᅡ-ᅵ])ᅨ/g, "$1ᆻ") // 쌍시옷 받침 약자
    .replace(/([ᄀ-ᄒ])((?=[^ᅡ-ᅵ])|$)/g, "$1ᅡ") // ㅏ 생략된거 복원 [ᄀ-ᄒ](?!\w)
    .replace(/([^ᄀ-ᄒ])(?=[ᅡ-ᅵ])/g, "$1ᄋ") // 초성 없는거에 ㅇ 붙임 // .replace(/(?<=[^ᄀ-ᄒ])([ᅡ-ᅵ])/g, "ᄋ$1")
    .replace(/(^[ᅡ-ᅵ])/g, "ᄋ$1") // 중성 먼저 시작하면 ㅇ 붙임




    .replace(/\(cap\)\(cap\)([a-z]*)(?=\s)/g, function(v) { // 영어
        return v.substring(10, v.length).toUpperCase(); // 영어 대문자 전체
    }).replace(/\(cap\)(.)/g, function(v) {
        return v.slice(-1).toUpperCase(); // 영어 대문자
    }); // 영어 대문자
}








if (lang == LANG_KO) {
    input = analyze_sub(m.tranlyze.key_b.kr, input);
} else if (lang == LANG_EN) {
    if (localStorage.s_braille_en_grade2 == "true") input = analyze_sub(m.tranlyze.key_b.en2, input);
    input = analyze_sub(m.tranlyze.key_b.en, input);
} else if (lang == LANG_JA) {
    input = analyze_sub(m.tranlyze.key_b.jp, input);
}
input = analyze_sub(m.tranlyze.key_b.nm, input);

output = input.join("")
    .replace(//g, '\n');

// if (lang == LANG_KO) assemble();
assemble();

return output;
}



// 해당 부분은 테스트 입니다. 


// 안녕하세요 테스트 
// analyze_b(1, "⠣⠒⠉⠻⠚⠠⠝⠬");


// 제 이름은 정해원 입니다. 
// analyze_b(1, "⠓⠊⠀⠍⠽⠀⠝⠁⠍⠑⠀⠊⠎⠀⠓⠑⠁⠕⠝");